NextHeadLSTM(
  (lstm): LSTM(64, 256, num_layers=2, batch_first=True, dropout=0.3)
  (classifier): Sequential(
    (0): LayerNorm((256,), eps=1e-05, elementwise_affine=True)
    (1): Dropout(p=0.3, inplace=False)
    (2): Linear(in_features=256, out_features=7, bias=True)
  )
)